minhhoang1349/STM32LAB2/LAB2_MCU/ex9/STM32F103C8_LAB2-ex9/project/Core/Inc/led.h
/*
 * led.h
 *
 *  Created on: Sep 28, 2023
 *      Author: HP
 */

#ifndef INC_LED_H_
#define INC_LED_H_

#include "stm32f1xx_hal.h"
#include<stdint.h>

extern const uint8_t chu_cai[208];

struct led8x8 {
	GPIO_TypeDef *gpio_col;
	uint16_t pin_c0;
	uint16_t pin_c1;
	uint16_t pin_c2;
	uint16_t pin_c3;
	uint16_t pin_c4;
	uint16_t pin_c5;
	uint16_t pin_c6;
	uint16_t pin_c7;
	GPIO_TypeDef *gpio_row;
	uint16_t pin_r0;
	uint16_t pin_r1;
	uint16_t pin_r2;
	uint16_t pin_r3;
	uint16_t pin_r4;
	uint16_t pin_r5;
	uint16_t pin_r6;
	uint16_t pin_r7;
	uint8_t *buffer;
};
void updateLED8x8(struct led8x8 *led, uint8_t index);
void initLED8x8(struct led8x8 *led, GPIO_TypeDef *gpio_col, uint16_t pin_c0,
		uint16_t pin_c1, uint16_t pin_c2, uint16_t pin_c3, uint16_t pin_c4,
		uint16_t pin_c5, uint16_t pin_c6, uint16_t pin_c7,
		GPIO_TypeDef *gpio_row, uint16_t pin_r0, uint16_t pin_r1,
		uint16_t pin_r2, uint16_t pin_r3, uint16_t pin_r4, uint16_t pin_r5,
		uint16_t pin_r6, uint16_t pin_r7, uint8_t *buffer);
struct seven_led {
	GPIO_TypeDef *gpio;
	uint16_t pin_a;
	uint16_t pin_b;
	uint16_t pin_c;
	uint16_t pin_d;
	uint16_t pin_e;
	uint16_t pin_f;
	uint16_t pin_g;
};
void init7SEG(struct seven_led *led, GPIO_TypeDef *gpio, uint16_t pin_a,
		uint16_t pin_b, uint16_t pin_c, uint16_t pin_d, uint16_t pin_e,
		uint16_t pin_f, uint16_t pin_g);
void display7SEG(const struct seven_led *led, unsigned short i);

#endif /* INC_LED_H_ */
